#pragma once
typedef struct SListNode
{
	int data;
	struct SListNode* next;
}SL;

typedef struct SLHEAD
{
	SL* head;
}HEAD;
//链表的尾插
void sl_add_end(HEAD* psl, int num);
//打印链表
void sl_print(HEAD* psl);
// 删除链表中等于给定值 val 的所有节点。
void sl_delall(HEAD* psl,int num);
//反转一个单链表。

//给定一个带有头结点 head 的非空单链表，返回链表的中间结点。如果有两个中间结点，则返回第二个中间结点。

//输入一个链表，输出该链表中倒数第k个结点。

//将两个有序链表合并为一个新的有序链表并返回。新链表是通过拼接给定的两个链表的所有节点组成的

//编写代码，以给定值x为基准将链表分割成两部分，所有小于x的结点排在大于或等于x的结点之前 。

//在一个排序的链表中，存在重复的结点，请删除该链表中重复的结点，重复的结点不保留，返回链表头指针。

//链表的回文结构。

//输入两个链表，找出它们的第一个公共结点。

//给定一个链表，判断链表中是否有环。

//给定一个链表，返回链表开始入环的第一个节点。 如果链表无环，则返回 NULL

//给定一个链表，每个节点包含一个额外增加的随机指针，该指针可以指向链表中的任何节点或空节点。要求返回这个链表的深度拷贝。

